package dataStructure.Arrays;

/**
 * @author s1mple
 * @create 2021/7/2-16:20
 */
public class ArrDemo {

    /**
     * 数组是具有相同类型的数据的集合,也就是说数组的所有元素的类型都是相同的,在所有的数据结构中
     * 数组算是最常见也是最简单一种数据结构,我们最常见的也就是一维数组,还有二维三维
     * 数组需要先声明才能使用,数组的大小一旦确定就不可以改变了.
     */
    int[] arr = new int[]{1, 2, 3};
    /**
     * 操作数组的类,我们常见的估计也就是ArrayList了,他对数组的操作非常简单,所有的数据都会存放到这个数组中
     */
    transient Object[] elementData;

    /**
     * 常见的数据结构种类也不是很多，比如，数组，链表，队列，栈，树，图，等，还有数组和链表结合的，
     * 比如HashMap.但每一种又会有很多的分类，比如链表有单向的，双向的，环形的，队列又有一般的队列
     * 和双端的队列，树又分为二叉树，AVL树，红黑树，B+树，2-3树，哈夫曼树，字典树等等。
     * 数组是最简单的一种数据结构，基本上没什么可说的。
     */

}
